
&НаСервере
Процедура ПериодСессииПриИзмененииНаСервере()
	Спр = Справочники.ПланСдачиСессии.НайтиПоНаименованию(Отчет.ПериодСессии); 
	Отчет.ДатаНачалаСессии = Спр.ПериодНачалаСессии; 
	Отчет.ДатаОкончанияСессии = Спр.периодОкончанияСессии; 
	Отчет.Семестр = Спр.Семестр; 
	Отчет.ФормаОбучения = Спр.ФормаОбучения; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСессииПриИзменении(Элемент)
	ПериодСессииПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	Отчет.ТЧ.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СессияОбороты.Группа КАК Группа,
	               |	СессияОбороты.КолчиествоВыставленныхОценокОборот КАК КолчиествоВыставленныхОценокОборот,
	               |	СессияОбороты.КоличествоАкадемическихЗадолженностейОборот КАК КоличествоАкадемическихЗадолженностейОборот,
	               |	СессияОбороты.КоличествоПроведенныхПереаттестацийОборот КАК КоличествоПроведенныхПереаттестацийОборот
	               |ИЗ
	               |	РегистрНакопления.Сессия.Обороты КАК СессияОбороты
	               |ГДЕ
	               |	СессияОбороты.Семестр = &Семестр"; 
	Запрос.УстановитьПараметр("Семестр",отчет.Семестр); 
	рез = Запрос.Выполнить().Выгрузить(); 
	
	Для каждого стр из рез Цикл 
		Спр = Справочники.Группы.НайтиПоНаименованию(Стр.Группа); 
		Если Спр.ФормаОбучения = отчет.ФормаОбучения Тогда 
		О= Отчет.ТЧ.Добавить(); 
		О.Группа = Стр.Группа; 
		О.КоличествоВыставленныхОценок = Стр.КолчиествоВыставленныхОценокОборот;
		О.КоличествоАкадемическихЗадолженностей = Стр.КоличествоАкадемическихЗадолженностейОборот;
		О.КоличествоПроведенныхПереаттестаций = Стр.КоличествоПроведенныхПереаттестацийОборот;  
		Конецесли; 	
		КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Функция ПЕЧАТЬНаСервере()
	ТабДок = новый ТабличныйДокумент; 
	
	Макет = отчеты.ОтчетОПроведенииСессии.ПолучитьМакет("Макет"); 
	
	Шапка = Макет.ПолучитьОбласть("Шапка"); 
	Шапка.Параметры.Дат1 = Отчет.ДатаНачалаСессии; 
	Шапка.Параметры.Дат2 = Отчет.ДатаОкончанияСессии; 
	Шапка.Параметры.Сем = Отчет.Семестр; 
	Шапка.Параметры.ФормО = Отчет.ФормаОбучения; 
	
	ТабДок.Вывести(Шапка); 
	
	шапкаТабл = Макет.ПолучитьОбласть("ШапкаТабл"); 
	Табдок.Вывести(ШапкаТабл); 
	
	Табл = Макет.ПолучитьОбласть("Табл"); 
	
	Для каждого стр из Отчет.ТЧ Цикл 
		Табл.Параметры.Груп = Стр.Группа; 
		Табл.Параметры.КолВыст = Стр.КоличествоВыставленныхОценок; 
		Табл.Параметры.КолПереат = Стр.КоличествоПроведенныхПереаттестаций; 
		Табл.Параметры.КолЗадол = Стр.КоличествоАкадемическихЗадолженностей; 
		ТабДок.Вывести(Табл); 
		
	КонецЦикла; 
	
	Возврат ТабДок; 
	
КонецФункции

&НаКлиенте
Процедура ПЕЧАТЬ(Команда)
	ТабДок = Новый ТабличныйДокумент; 
	ТабДок = ПЕЧАТЬНаСервере(); 
	ТабДок.Показать();
КонецПроцедуры
