
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
		Для каждого стр из Объект.СписокСтудентов Цикл   
		
		Док = Документы.ЗачетнаяКнижкаСтудента.НайтиПоРеквизиту("Студент",Стр.Студент).ПолучитьОбъект();
		Парам = Новый Структура; 
		Парам.Вставить("Дисциплина",Объект.Дисциплина); 
		парам.Вставить("Семестр",Объект.Семестр); 
		НС = Док.СписокАттестационныхДисцилин.НайтиСтроки(Парам); 
		Если НС.Количество() = 0 Тогда
			 О = Док.СписокАттестационныхДисцилин.Добавить(); 
			 О.Дисциплина = Объект.Дисциплина; 
			 О.Семестр = Объект.Семестр; 
			 О.КоличествоЧасов = Объект.КоличествоЧасов; 
			 О.Оценка = Стр.Оценка; 
			 О.Преподаватель = Объект.Преподаватель; 
		Док.Записать(РежимЗаписиДокумента.Запись); 
		Док.Записать(РежимЗаписиДокумента.Проведение); 
		КонецЕсли; 
		
		
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	ТабДок = Новый ТабличныйДокумент; 
	ТабДок = ПечатьНаСервере(); 
	табДок.Показать();
КонецПроцедуры


&НаСервере
Функция ПечатьНаСервере() 
	ТабДок = Новый ТабличныйДокумент; 
	
	Макет = Документы.ЗачетноЭкзаментационнаяВедомость.ПолучитьМакет("Макет"); 
	
	Областьшапка= Макет.ПолучитьОбласть("шапка"); 
	
	Областьшапка.Параметры.Ном = объект.Номер; 
	ТабДок.Вывести(Областьшапка); 
	
	Шапка2 = Макет.ПолучитьОбласть("Шапка2"); 
	
	Шапка2.Параметры.Экзаменатор = Объект.Преподаватель; 
	  Спр = Справочники.Группы.НайтиПоНаименованию(Объект.Группа); 
	 Запрос = Новый Запрос; 
	 Запрос.Текст = "ВЫБРАТЬ
	                |	КафедрыПрофилиНаправления.Ссылка.Факультет КАК Факультет,
	                |	КафедрыПрофилиНаправления.Ссылка КАК Ссылка
	                |ИЗ
	                |	Справочник.Кафедры.ПрофилиНаправления КАК КафедрыПрофилиНаправления
	                |ГДЕ
	                |	КафедрыПрофилиНаправления.Профиль = &Профиль"; 
	 Запрос.УстановитьПараметр("Профиль",Спр.ПрофильНаправления); 
	 Рез = Запрос.Выполнить().Выбрать(); 
	 рез.Следующий(); 
	 
	Шапка2.Параметры.Факультет = Рез.Факультет; 
	Док2 = Документы.ФормированиеУчебныхГрупп.НайтиПоРеквизиту("НомерГруппы",Объект.Группа); 
	Шапка2.Параметры.Курс = Док2.Курс; 
	Шапка2.Параметры.Сем = Объект.Семестр; 
	Шапка2.Параметры.Груп = Объект.Группа; 
	Шапка2.Параметры.Специальность = Спр.ПрофильНаправления; 
	Шапка2.Параметры.ФормОб = Док2.ФормаОбучения; 
	Шапка2.Параметры.Дисциплина = Объект.Дисциплина; 
	Шапка2.Параметры.КолЧас = Объект.КоличествоЧасов;
	Шапка2.Параметры.Дат = Объект.Дата; 
	Если Объект.ФормаАттестации = перечисления.АттестационныеМероприятия.Экзамен Тогда 
		
	Шапка2.Параметры.ОтмЭ = "v";  
Конецесли; 
  	Если Объект.ФормаАттестации = перечисления.АттестационныеМероприятия.КурсоваяРабота Тогда 
		
	Шапка2.Параметры.ОтмК = "v";  
Конецесли; 
	Если Объект.ФормаАттестации = перечисления.АттестационныеМероприятия.Зачет Тогда 
		
	Шапка2.Параметры.ОтмЗ = "v";  
Конецесли;	
Если Объект.ФормаАттестации = перечисления.АттестационныеМероприятия.ДиффЗачет Тогда 
		
	Шапка2.Параметры.ОтмДифф = "v";  
Конецесли;

ТабДок.Вывести(Шапка2); 

ШапкаТабл = Макет.ПолучитьОбласть("ШапкаТаблицы"); 
Табдок.Вывести(ШапкаТабл);  

Табл = Макет.ПолучитьОбласть("ТаблицаСтудентов");
Ном = 0; 

Для каждого стр из Объект.СписокСтудентов Цикл 
	Ном = Ном +1; 
	Табл.Параметры.НомСт = Ном;  
	Табл.Параметры.ФИОСтудент = Стр.Студент; 
	Табл.Параметры.НомЗачетки = Стр.НомерЗачетнойКнижки; 
	Если Стр.НеЯвка = Истина Тогда 
	Табл.Параметры.НЯ = "v"; 
КонецЕсли; 
Если Объект.ФормаАттестации = перечисления.АттестационныеМероприятия.Зачет Тогда 
	  Табл.Параметры.Оценка = Стр.Оценка; 
  Иначе 
	  Если Стр.Оценка = 5 Тогда 
		Табл.Параметры.Пять = "v";
	КонецЕсли; 
     Если Стр.Оценка = 4 Тогда 
		Табл.Параметры.Четыр = "v";
	КонецЕсли;
	 Если Стр.Оценка = 3 Тогда 
		Табл.Параметры.Три = "v";
	КонецЕсли;
	 Если Стр.Оценка = 2 Тогда 
		Табл.Параметры.Два = "v";
	КонецЕсли;
КонецЕсли;

ТабДок.Вывести(Табл); 
  
	
	
КонецЦикла;

Подпись = макет.ПолучитьОбласть("Подпись"); 
Табдок.Вывести(Подпись); 

Подвал = макет.ПолучитьОбласть("Подвал"); 

Подвал.Параметры.Всего = Ном; 
 Оценка5 = 0; 
	  Оценка4 = 0;
	  Оценка3 = 0;
	 Оценка2 = 0;
	 Зачет = 0; 
	 Незачет = 0; 
	 Неявка = 0; 
 
	 Для каждого строка из Объект.СписокСтудентов Цикл
	     Если Строка.Оценка = перечисления.ВидыОценокЗачет.Зачтено Тогда 
	    	 Зачет = Зачет +1; 
	     КонецЕсли; 
	     Если Строка.Оценка = перечисления.ВидыОценокЗачет.НеЗачтено Тогда 
	    	 Незачет = Незачет +1; 
	    КонецЕсли; 
	    Если Строка.Оценка = 5 Тогда 
	    	 Оценка5 = Оценка5 +1; 
	    КонецЕсли;
	    Если Строка.Оценка = 4 Тогда 
	    	 Оценка4 = Оценка4 +1; 
	     КонецЕсли;
	     Если Строка.Оценка = 3 Тогда 
	    	 Оценка3 = Оценка3 +1; 
	     КонецЕсли;
	      Если Строка.Оценка = 2 Тогда 
	    	 Оценка2 = Оценка2 +1; 
	     КонецЕсли;
	     Если Строка.НеЯвка = Истина Тогда 
	    	 Неявка = неявка +1; 
	     КонецЕсли; 
	      
	 КонецЦикла; 
	 
 
	 Подвал.Параметры.Отл = Оценка5; 
	 Подвал.Параметры.Хор = Оценка4; 
	 Подвал.Параметры.Удв = оценка3; 
	 Подвал.Параметры.НеУдв = оценка2; 
	 Подвал.Параметры.Зачет = Зачет; 
	 Подвал.Параметры.НеЗачет = Незачет; 
	 Подвал.Параметры.НеЯвка = Неявка; 
	
	 
	 табДок.Вывести(подвал); 
	 
	Возврат табДок; 
	 







	
КонецФункции


&НаСервере
Процедура ПриОткрытииНаСервере() 
 	Если Объект.Выдана = Ложь Тогда 
		ЭтаФорма.Элементы.СписокСтудентов.Доступность = Ложь; 
	КонецЕсли; 
	
	
КонецПроцедуры

