Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РейтингСтудентов 
	Движения.РейтингСтудентов.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ Из ТЧ Цикл
		Движение = Движения.РейтингСтудентов.Добавить();
		Движение.Период = Дата;
		Движение.Студент = ТекСтрокаТЧ.Студент;
		Движение.Группа = Группа;
		Движение.Семестр = Семестр;
		Движение.ОбщийРейтинг = ТекСтрокаТЧ.БаллПромежуточнойАттестации;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры