
&НаСервере
Процедура ТЧБаллПромежуточнойАттестацииПриИзмененииНаСервере()
КонецПроцедуры

&НаКлиенте
Процедура ТЧБаллПромежуточнойАттестацииПриИзменении(Элемент)
		Стр = Элементы.ТЧ.ТекущиеДанные; 
	Если Стр.БаллПромежуточнойАттестации > 100 ИЛИ Стр.БаллПромежуточнойАттестации < 0 Тогда 
		Сообщить("Минимальный балл который можно получить за тест 0, максимальный 100!"); 
		Стр.БаллПромежуточнойАттестации = ""; 
	КонецЕсли;
	ТЧБаллПромежуточнойАттестацииПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДисциплинаПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ГруппаПриИзмененииНаСервере()
	Спр = Справочники.Группы.НайтиПоНаименованию(Объект.Группа); 
	Объект.ФормаОбучения = Спр.ФормаОбучения; 
	Объект.ПрофильНаправления = Спр.ПрофильНаправления;
КонецПроцедуры

&НаКлиенте
Процедура ГруппаПриИзменении(Элемент)
	ГруппаПриИзмененииНаСервере();
КонецПроцедуры
