
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Есть = 0; 
	нет = 0; 
	Запрос = Новый запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПланСдачиСессии.ПериодНачалаСессии КАК ПериодНачалаСессии
	               |ИЗ
	               |	Справочник.ПланСдачиСессии КАК ПланСдачиСессии"; 
	Рез = Запрос.Выполнить().Выгрузить(); 
	Для каждого стр из Рез Цикл
		Если  НачалоДня(Стр.ПериодНачалаСессии) > НачалоДня(ТекущаяДата()) Тогда 
	РазницаВДнях = (НачалоДня(Стр.ПериодНачалаСессии) - НачалоДня(ТекущаяДата())) / (60 * 60 * 24);	
	Если РазницаВДнях = 1 Тогда 
		  Есть = Есть +1; 
	  Иначе 
		  Нет = Нет +1; 
	КонецЕсли; 
КонецЕсли;


КонецЦикла; 

Если Есть >0 Тогда 
	Объект.ПодходящийСрокВыдачиВедомостей = Истина; 
 КонецЕсли; 
    

КонецПроцедуры

&НаСервере
Процедура ОбновитьКартуНаСервере()
	// Конвертируем объект формы в объект бизнес-процесса
	ОбъектБП = РеквизитФормыВЗначение("Объект");                       
	// Вызываем метод получения карты 
        // маршрута текущего бизнес-процесса
	Карта = ОбъектБП.ПолучитьКартуМаршрута(); 	// Вставить содержимое обработчика.
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКарту(Команда)
	ОбновитьКартуНаСервере();
КонецПроцедуры


