
&НаСервере
Процедура КураторПриИзмененииНаСервере()
	Спр= Справочники.ПреподавательскийСостав.НайтиПоНаименованию(Объект.Куратор); 
	Если НЕ Спр.Кафедра = Объект.Кафедра Тогда 
		Сообщить("Выбранный преподаватель не относится к кафедре" + " " + Объект.Кафедра); 
		Объект.Куратор = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КураторПриИзменении(Элемент)
	КураторПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КафедраПриИзмененииНаСервере()
	Спр = Справочники.Кафедры.НайтиПоНаименованию(Объект.Кафедра); 
	Если НЕ Спр.Факультет = Объект.Факультет Тогда 
		Сообщить("Выбранная кафедра не относится к факультету" + " " + Объект.Факультет); 
		Объект.Кафедра = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КафедраПриИзменении(Элемент)
	КафедраПриИзмененииНаСервере();
КонецПроцедуры
