
&НаСервере
Процедура ПрофильНаправленияПриИзмененииНаСервере()
	Запрос = Новый запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбразовательныеПрограммыПрофилиНаправления.НомерСтроки КАК НомерСтроки,
	               |	ОбразовательныеПрограммыПрофилиНаправления.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ОбразовательныеПрограммы.ПрофилиНаправления КАК ОбразовательныеПрограммыПрофилиНаправления
	               |ГДЕ
	               |	ОбразовательныеПрограммыПрофилиНаправления.ПрофилиНаправления = &ПрофилиНаправления
	               |	И ОбразовательныеПрограммыПрофилиНаправления.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ПрофилиНаправления",Объект.ПрофильНаправления); 
	Запрос.УстановитьПараметр("Ссылка",Объект.ОбразовательнаяПрограмма); 
	Рез = Запрос.Выполнить().Выбрать(); 
	рез.Следующий(); 
	Если ПустаяСтрока(рез.Ссылка) тогда 
		Сообщить("Выбарнный профиль специальности не относится к образовательной программе" + " " + Объект.ОбразовательнаяПрограмма); 
		Объект.ПрофильНаправления = "";  
	Иначе 
		Спр= Справочники.ПрофилиНаправления.НайтиПоНаименованию(Объект.ПрофильНаправления); 
		Объект.УровеньОбразования = Спр.УровеньОбразования; 
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПрофильНаправленияПриИзменении(Элемент)
	ПрофильНаправленияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КураторПриИзмененииНаСервере()
	Спр= Справочники.ПреподавательскийСостав.НайтиПоНаименованию(Объект.Куратор); 
	Если НЕ Спр.Кафедра = Объект.Кафедра Тогда 
		Сообщить("Выбранный преподаватель не относится к кафедре" + " " + Объект.Кафедра); 
		Объект.Куратор = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КураторПриИзменении(Элемент)
	КураторПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КафедраПриИзмененииНаСервере()
	Спр = Справочники.Кафедры.НайтиПоНаименованию(Объект.Кафедра); 
	Если НЕ Спр.Факультет = Объект.Факультет Тогда 
		Сообщить("Выбранная кафедра не относится к факультету" + " " + Объект.Факультет); 
		Объект.Кафедра = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КафедраПриИзменении(Элемент)
	КафедраПриИзмененииНаСервере();
КонецПроцедуры
