
&НаСервере
Процедура СформироватьНаСервере()
		
	//ПОИСК текущего контроля 
	
	Запрос = Новый запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	|	Группы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Группы КАК Группы
	|ГДЕ
	|	Группы.ПрофильНаправления = &ПрофильНаправления
	|	И Группы.ФормаОбучения = &ФормаОбучения
	|	И Группы.ГодНачалаОбучения = &ГодНачалаОбучения";
	Запрос.УстановитьПараметр("ПрофильНаправления",Отчет.направлениеПодготовки); 
	Запрос.УстановитьПараметр("ФормаОбучения",Отчет.ФормаОбучения);
	Запрос.УстановитьПараметр("ГодНачалаОбучения",Отчет.ГодНачалаОбучения); 
	рез = Запрос.Выполнить().Выгрузить(); 
	Для каждого стр из Рез Цикл 
		ЗапросТекКонтр = Новый запрос; 
		ЗапросТекКонтр.Текст = "ВЫБРАТЬ
		                       |	ТекущийКонтроль.Дисциплина КАК Дисциплина,
		                       |	ТекущийКонтроль.ВидКонтроля КАК ВидКонтроля,
		                       |	ТекущийКонтроль.Ссылка КАК Ссылка,
		                       |	ТекущийКонтроль.Номер КАК Номер
		                       |ИЗ
		                       |	Документ.ТекущийКонтроль КАК ТекущийКонтроль
		                       |ГДЕ
		                       |	ТекущийКонтроль.Группа = &Группа
		                       |	И ТекущийКонтроль.Семестр = &Семестр"; 
		ЗапросТекКонтр.УстановитьПараметр("Группа",Стр.Ссылка); 
		ЗапросТекКонтр.УстановитьПараметр("Семестр",Отчет.Семестр); 
		Р = ЗапросТекКонтр.Выполнить().Выгрузить(); 
		Для каждого строка из Р Цикл 
			О = Отчет.ТЧ.Добавить(); 
			О.Группа = Стр.Ссылка; 
			О.Дисциплина = Строка.Дисциплина; 
			О.ВидКонтроля = "Текущий контроль"; 
			О.ВидАттестации = Строка.ВидКонтроля;
			ВыставленныеОценки = 0; 
			Долги = 0; 
			ЗапросОценки = Новый Запрос; 
			ЗапросОценки.Текст = "ВЫБРАТЬ
			                     |	ТекущийКонтрольСписокСтудентов.Оценка КАК Оценка
			                     |ИЗ
			                     |	Документ.ТекущийКонтроль.СписокСтудентов КАК ТекущийКонтрольСписокСтудентов
			                     |ГДЕ
			                     |	ТекущийКонтрольСписокСтудентов.Ссылка.Номер = &Номер";
			
			 ЗапросОценки.УстановитьПараметр("Номер",Строка.Номер); 
			 Ррр = ЗапросОценки.Выполнить().Выгрузить(); 
			 Для каждого Нстр из Ррр Цикл
				 Если Не ПустаяСтрока(НСтр.Оценка) Тогда 
					ВыставленныеОценки = ВыставленныеОценки +1; 
				Иначе 
					Долги = Долги +1; 
				КонецЕсли; 
				
				 
			КонецЦикла; 
			О.КоличествоОценок =  ВыставленныеОценки; 
			О.КоличествоАкадемическихЗадолженностей = Долги; 
			 
		КонецЦикла; 
		
		
	КонецЦикла;
	
	//ПОИСК промежуточной аттестации
	
	ЗапросПромАтт = Новый Запрос; 
	ЗапросПромАтт.Текст = "ВЫБРАТЬ
	                      |	ПромежуточнаяАттестация.Номер КАК Номер,
	                      |	ПромежуточнаяАттестация.Дисциплина КАК Дисциплина,
	                      |	ПромежуточнаяАттестация.ВидАттестации КАК ВидАттестации,
	                      |	ПромежуточнаяАттестация.Группа КАК Группа
	                      |ИЗ
	                      |	Документ.ПромежуточнаяАттестация КАК ПромежуточнаяАттестация
	                      |ГДЕ
	                      |	ПромежуточнаяАттестация.ПрофильНаправления = &ПрофильНаправления
	                      |	И ПромежуточнаяАттестация.ФормаОбучения = &ФормаОбучения
	                      |	И ПромежуточнаяАттестация.Семестр = &Семестр"; 
	
	 ЗапросПромАтт.УстановитьПараметр("ПрофильНаправления",Отчет.направлениеПодготовки); 
	 ЗапросПромАтт.УстановитьПараметр("ФормаОбучения",Отчет.ФормаОбучения); 
	 ЗапросПромАтт.УстановитьПараметр("Семестр",Отчет.Семестр); 
	 результатПоиска = ЗапросПромАтт.Выполнить().Выгрузить(); 
	 
	 КолОценокПромежАтт = 0; 
	 КолДолгов = 0; 
	 
	 Для каждого Нстрока из результатПоиска Цикл
		 ЗапросРезультатыПА = Новый Запрос; 
		 ЗапросРезультатыПА.Текст = "ВЫБРАТЬ
		                            |	ПромежуточнаяАттестацияТЧ.БаллПромежуточнойАттестации КАК БаллПромежуточнойАттестации
		                            |ИЗ
		                            |	Документ.ПромежуточнаяАттестация.ТЧ КАК ПромежуточнаяАттестацияТЧ
		                            |ГДЕ
		                            |	ПромежуточнаяАттестацияТЧ.Ссылка.Номер = &Номер";
		    ЗапросРезультатыПА.УстановитьПараметр("Номер",Нстрока.Номер); 
			результатРезультатов = ЗапросРезультатыПА.Выполнить().Выгрузить(); 
			Для каждого Р из результатРезультатов Цикл 
				Если ПустаяСтрока(Р.БаллПромежуточнойАттестации) Тогда 
				 КолДолгов = КолДолгов + 1; 
			 Иначе 
				КолОценокПромежАтт = КолОценокПромежАтт +1; 
			КонецЕсли; 
			
				
		КонецЦикла;
		О = Отчет.ТЧ.Добавить(); 
		о.Группа = Нстрока.группа; 
		О.Дисциплина = Нстрока.Дисциплина; 
		О.ВидКонтроля = "Промежуточная аттестация"; 
		О.ВидАттестации = Нстрока.ВидАттестации; 
		О.КоличествоОценок =КолОценокПромежАтт; 
		О.КоличествоАкадемическихЗадолженностей = КолДолгов; 
			
	КонецЦикла;   
	
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Функция ПЕЧАТЬНаСервере() 
	ТабДок = Новый ТабличныйДокумент; 
	
	Макет = Отчеты.УспеваемостьГруппПоДисцилинам.ПолучитьМакет("Макет"); 
	
	Шапка = Макет.ПолучитьОбласть("Шапка"); 
	
	Шапка.Параметры.Сем = отчет.Семестр; 
	Табдок.Вывести(Шапка); 
	
	Шапкатабл = Макет.ПолучитьОбласть("ШапкаТабл"); 
	ТабДок.Вывести(Шапкатабл); 
	
	Табл = макет.ПолучитьОбласть("табл"); 
	
	Для каждого стр из Отчет.ТЧ Цикл 
		Табл.Параметры.Груп = Стр.Группа; 
		Табл.Параметры.Дисц = Стр.Дисциплина; 
		Табл.Параметры.Форма = Стр.ВидКонтроля; 
		Табл.Параметры.Вид = Стр.ВидАттестации; 
		Табл.Параметры.Выст = Стр.КоличествоОценок; 
		табл.Параметры.Академ = Стр.КоличествоАкадемическихЗадолженностей; 
		
		табдок.Вывести(Табл); 
		
		
	КонецЦикла;
	
	Возврат ТабДок; 
	
	
	// Вставить содержимое обработчика.
КонецФункции


&НаКлиенте
Процедура ПЕЧАТЬ(Команда)
	ТабДок = Новый ТабличныйДокумент; 
	Табдок = ПЕЧАТЬНаСервере(); 
	ТабДок.Показать();
КонецПроцедуры
