
&НаСервере
Процедура СоздатьДокументПересдачиНаСервере()
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	переаттестация.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.переаттестация КАК переаттестация
	               |ГДЕ
	               |	переаттестация.ЗаявлениеНаПересдачу = &ЗаявлениеНаПересдачу";
	Запрос.УстановитьПараметр("ЗаявлениеНаПересдачу",Объект.Ссылка); 
	Рез = Запрос.Выполнить().Выбрать(); 
	рез.Следующий(); 
	Если НЕ ПустаяСтрока(рез.Ссылка) Тогда 
		Сообщить("Ранее был создан документ переаттестации по данному заявлению"); 
	Иначе 
		
	Док = Документы.переаттестация.СоздатьДокумент(); 
	Док.Дата = ТекущаяДата(); 
	Док.ЗаявлениеНаПересдачу = Объект.Ссылка; 
	Спр = Справочники.СписокСтудентов.НайтиПоНаименованию(Объект.Студент);
	Группа = Справочники.Группы.НайтиПоНаименованию(Спр.Группа); 
	Док.Факультет = Группа.Факультет; 
	Док.НаправлениеПодготовки = Спр.ПрофильНаправления;  
	Док.Студент = Объект.Студент; 
	Док.НомерЗачетнойКнижки = Спр.НомерЗачетнойКнижки;  
	
	Для каждого стр из Объект.ТЧ Цикл
		О = Док.ТЧ.Добавить(); 
		О.Дисциплина = Стр.Дисциплина; 
		СпрДисц = Справочники.РабочаяПрограммаДисцилины.НайтиПоНаименованию(Стр.Дисциплина); 
		Парам = Новый Структура; 
		Парам.Вставить("Семестр",Стр.Семестр); 
		Парам.Вставить("ОбразовательнаяПрограмма",Группа.ОбразовательнаяПрограмма); 
		Парам.Вставить("ФормаОбучения",Спр.ФормаОбучения);  
		НС = СпрДисц.Аттестация.НайтиСтроки(Парам); 
		Для каждого строка из НС Цикл   
			О.КоличествоЧасов = Строка.КоличествоЧасов; 
			О.ФормаИтоговогоКонтроля = Строка.ВидАттестации; 
			
		КонецЦикла; 
		 
		
		
		
	КонецЦикла;
	Док.Семестр = Стр.Семестр; 
	   Попытка 
	 Док.Записать(РежимЗаписиДокумента.Запись); 
	 Док.Записать(РежимЗаписиДокумента.Проведение);  
	 Сообщить("Создан документ переаттестации для студента" + " " + Объект.Студент); 
 Исключение 
	 Сообщить("Документ переаттестации не создан"); 
 КонецПопытки; 
 
 КонецЕсли; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументПересдачи(Команда)
	СоздатьДокументПересдачиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТЧДисциплинаПриИзмененииНаСервере(Дисц,Семестр,Препод,Курс)
	Запрос = Новый запрос; 
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Семестр КАК Семестр,
	               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.КоличествоЧасов КАК КоличествоЧасов,
	               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.перезачтено КАК перезачтено,
	               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Преподаватель КАК Преподаватель
	               |ИЗ
	               |	Документ.ЗачетнаяКнижкаСтудента.СписокАттестационныхДисцилин КАК ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин
	               |ГДЕ
	               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Дисциплина = &Дисциплина
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Семестр УБЫВ";
          Запрос.УстановитьПараметр("Дисциплина",Дисц);
		  Рез = Запрос.Выполнить().Выбрать();  
		  рез.Следующий(); 
		  Препод = рез.Преподаватель;  
		  Семестр = Рез.Семестр;
		  Если Семестр = перечисления.Семестры.Псеместр ИЛИ Семестр = Перечисления.Семестры.Втсеместр Тогда 
			  Курс = 1; 
		  КонецЕсли; 
		  Если Семестр = перечисления.Семестры.Трсеместр ИЛИ Семестр = перечисления.Семестры.Чтсеместр Тогда 
			  Курс = 2; 
		  КонецЕсли; 
		  Если Семестр = перечисления.Семестры.ПятСеместр или Семестр = перечисления.Семестры.Втсеместр Тогда 
			  Курс = 3; 
		  КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧДисциплинаПриИзменении(Элемент)
	Стр = Элементы.ТЧ.ТекущиеДанные; 
	Дисц = Стр.Дисциплина; 
	Семестр = "";
	Курс = "";
	Препод = "";
	ТЧДисциплинаПриИзмененииНаСервере(Дисц,Семестр,Препод,Курс); 
	Стр.Преподаватель = Препод; 
	Стр.Семестр = Семестр;  
	Стр.Курс = Курс; 
	 
	
	
КонецПроцедуры

&НаСервере
Процедура СтудентПриИзмененииНаСервере()
	Спр = Справочники.СписокСтудентов.НайтиПоНаименованию(Объект.Студент); 
	Объект.Группа = Спр.Группа; 
КонецПроцедуры

&НаКлиенте
Процедура СтудентПриИзменении(Элемент)
	СтудентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()
	ТабДок = Новый ТабличныйДокумент; 
	
	Макет = Документы.ЗаявленияНаПересдачу.ПолучитьМакет("Макет"); 
	
	Шапка = Макет.ПолучитьОбласть("Шапка"); 
	Шапка.Параметры.Проректор = Константы.ПроректорПоУчебнойРаботе.Получить(); 
	Шапка.Параметры.Группа = Объект.Группа; 
	Шапка.Параметры.ФИО = Объект.Студент; 
	
	ТабДок.Вывести(Шапка); 
	Ном = 0;
	Табл = Макет.ПолучитьОбласть("табл"); 
	
	Для каждого стр из Объект.ТЧ Цикл   
		Ном= Ном +1; 
		табл.Параметры.Ном = Ном; 
		Табл.Параметры.Дисц = Стр.Дисциплина; 
		Табл.Параметры.Сем = Стр.Семестр; 
		табл.Параметры.Курс = Стр.Курс; 
		Табл.Параметры.Препод = Стр.Преподаватель; 
		
		ТабДок.Вывести(Табл); 
		
		
	КонецЦикла; 
	
	Подвал = Макет.ПолучитьОбласть("Подвал"); 
	Подвал.Параметры.Датнач = Объект.ДатаНачалаПереаттестации; 
	Подвал.Параметры.Дат = объект.Дата; 
	
	ТабДок.Вывести(Подвал); 
	
	Пробел = Макет.ПолучитьОбласть("Пробел"); 
	Табдок.Вывести(Пробел); 
	
	Подпись = Макет.ПолучитьОбласть("Подпись"); 
	
	Табдок.Вывести(Подпись);   
	
	Пробел2 = Макет.ПолучитьОбласть("Пробел2"); 
	Табдок.Вывести(Пробел2);  
	
	 Спр = Справочники.Группы.НайтиПоНаименованию(Объект.Группа); 
	 Факультет = Спр.Факультет; 
	 
	 Спр2 = Справочники.Факультеты.НайтиПоНаименованию(Факультет); 
	 
	 Подпись2 = Макет.ПолучитьОбласть("Подпись2"); 
	 
	 Подпись2.Параметры.Декан = Спр2.ДеканФакультета; 
	 
	 Табдок.Вывести(Подпись2);
	
	
	Возврат ТабДок; 
	
	
	
КонецФункции

&НаКлиенте
Процедура Печать(Команда)

	Табдок = Новый ТабличныйДокумент; 
	Табдок = ПечатьНаСервере();
	табДок.показать(); 
КонецПроцедуры
