
&НаСервере
Процедура СформироватьНаСервере()
	отчет.ТЧ.Очистить();
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	переаттестацияТЧ.Ссылка.Студент КАК Студент,
	               |	переаттестацияТЧ.Ссылка.НомерЗачетнойКнижки КАК НомерЗачетнойКнижки,
	               |	переаттестацияТЧ.Дисциплина КАК Дисциплина,
	               |	переаттестацияТЧ.Оценка КАК Оценка
	               |ИЗ
	               |	Документ.переаттестация.ТЧ КАК переаттестацияТЧ
	               |ГДЕ
	               |	переаттестацияТЧ.Ссылка.Семестр = &Семестр";
	Запрос.УстановитьПараметр("Семестр",Отчет.Семестр); 
	рез = Запрос.Выполнить().Выгрузить(); 
	Для каждого стр из Рез Цикл
		о = Отчет.ТЧ.Добавить(); 
		О.Студент = Стр.Студент; 
		Спр = Справочники.СписокСтудентов.НайтиПоНаименованию(Стр.Студент); 
		О.Группа = Спр.Группа; 
		О.НомерЗачетнойКнижки = Стр.НомерЗачетнойКнижки; 
		О.Дисциплина = Стр.Дисциплина; 
		О.Оценка = Стр.Оценка; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Функция ПЕЧАТЬНаСервере()
	табДок = Новый ТабличныйДокумент; 
	
	Макет = Отчеты.ОтчетОПроведенииПереаттестации.ПолучитьМакет("Макет"); 
	
	Шапка = Макет.ПолучитьОбласть("Шапка"); 
	
	Шапка.Параметры.Сем = отчет.Семестр; 
	
	табДок.Вывести(Шапка); 
	
	ШапкаТабл = Макет.ПолучитьОбласть("ШапкаТабл"); 
	
	ТабДок.Вывести(ШапкаТабл); 
	
	Табл = Макет.ПолучитьОбласть("Табл"); 
	
	Для каждого стр из Отчет.ТЧ Цикл
		Табл.Параметры.Студ = стр.Студент; 
		Табл.Параметры.Груп = Стр.Группа; 
		табл.Параметры.Зачетка = Стр.НомерЗачетнойКнижки; 
		Табл.Параметры.Дисц = стр.Дисциплина; 
		Табл.Параметры.Оценка = Стр.Оценка; 
		
		табДок.Вывести(табл); 
		
	КонецЦикла;
	
	Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура ПЕЧАТЬ(Команда)
	ТабДок = Новый ТабличныйДокумент; 
	Табдок = ПЕЧАТЬНаСервере(); 
	ТабДок.Показать();
КонецПроцедуры
