
&НаСервере
Процедура СоздатьЗаписьВЖурналеУчетаВыдачиВедомостейНаСервере()
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗачетноЭкзаментационнаяВедомость.Ссылка КАК Ссылка,
	               |	ЗачетноЭкзаментационнаяВедомость.Группа КАК Группа,
	               |	ЗачетноЭкзаментационнаяВедомость.Дисциплина КАК Дисциплина,
	               |	ЗачетноЭкзаментационнаяВедомость.Преподаватель КАК Преподаватель
	               |ИЗ
	               |	Документ.ЗачетноЭкзаментационнаяВедомость КАК ЗачетноЭкзаментационнаяВедомость
	               |ГДЕ
	               |	ЗачетноЭкзаментационнаяВедомость.Семестр = &Семестр
	               |	И ЗачетноЭкзаментационнаяВедомость.Выдана = &Выдана"; 
	запрос.УстановитьПараметр("Семестр",объект.Семестр); 
	Запрос.УстановитьПараметр("Выдана",Ложь); 
	рез = Запрос.Выполнить().Выгрузить(); 
	Для каждого стр из рез Цикл 
		О = Объект.ТЧ.Добавить(); 
		О.Ведомость = Стр.Ссылка; 
		О.Группа = Стр.Группа; 
		О.Дисциплина = Стр.Дисциплина; 
		О.Принял = Стр.Преподаватель; 
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаписьВЖурналеУчетаВыдачиВедомостей(Команда)
	СоздатьЗаписьВЖурналеУчетаВыдачиВедомостейНаСервере();
КонецПроцедуры
