
&НаСервере
Процедура ТЧВедомостьПриИзмененииНаСервере(Ссылка,Группа,Дисц,Принял)
Запрос = Новый Запрос; 
Запрос.Текст = "ВЫБРАТЬ
               |	ЗачетноЭкзаментационнаяВедомость.Группа КАК Группа,
               |	ЗачетноЭкзаментационнаяВедомость.Дисциплина КАК Дисциплина,
               |	ЗачетноЭкзаментационнаяВедомость.Преподаватель КАК Преподаватель
               |ИЗ
               |	Документ.ЗачетноЭкзаментационнаяВедомость КАК ЗачетноЭкзаментационнаяВедомость
               |ГДЕ
               |	ЗачетноЭкзаментационнаяВедомость.Ссылка = &Ссылка";
запрос.УстановитьПараметр("Ссылка",Ссылка); 
Рез = Запрос.Выполнить().Выбрать(); 
рез.Следующий(); 
Группа = рез.Группа; 
Дисц  = рез.Дисциплина; 
Принял = рез.Преподаватель; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧВедомостьПриИзменении(Элемент)
	Стр = Элементы.ТЧ.ТекущиеДанные; 
	ссылка = Стр.Ведомость; 
	Группа = "";
	Дисц = "";
	Принял = "";
	ТЧВедомостьПриИзмененииНаСервере(Ссылка,Группа,Дисц,Принял); 
	Стр.Группа = Группа; 
	Стр.Дисциплина = Дисц; 
	Стр.Принял = Принял; 
КонецПроцедуры

&НаСервере
Процедура ФормаСформироватьПереченьВедомостейНаСервере()
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗачетноЭкзаментационнаяВедомость.Ссылка КАК Ссылка,
	               |	ЗачетноЭкзаментационнаяВедомость.Группа КАК Группа,
	               |	ЗачетноЭкзаментационнаяВедомость.Дисциплина КАК Дисциплина,
	               |	ЗачетноЭкзаментационнаяВедомость.Преподаватель КАК Преподаватель
	               |ИЗ
	               |	Документ.ЗачетноЭкзаментационнаяВедомость КАК ЗачетноЭкзаментационнаяВедомость
	               |ГДЕ
	               |	ЗачетноЭкзаментационнаяВедомость.Семестр = &Семестр
	               |	И ЗачетноЭкзаментационнаяВедомость.Выдана = &Выдана"; 
	запрос.УстановитьПараметр("Семестр",объект.Семестр); 
	Запрос.УстановитьПараметр("Выдана",Ложь); 
	рез = Запрос.Выполнить().Выгрузить(); 
	Для каждого стр из рез Цикл 
		О = Объект.ТЧ.Добавить(); 
		О.Ведомость = Стр.Ссылка; 
		О.Группа = Стр.Группа; 
		О.Дисциплина = Стр.Дисциплина; 
		О.Принял = Стр.Преподаватель; 
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ФормаСформироватьПереченьВедомостей(Команда)
	ФормаСформироватьПереченьВедомостейНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПериодСессииПриИзмененииНаСервере()
	Спр = Справочники.ПланСдачиСессии.НайтиПоНаименованию(Объект.периодСессии); 
	Объект.ДатаНачалаСессии = Спр.ПериодНачалаСессии; 
	Объект.ДатаОкончанияСессии = Спр.периодОкончанияСессии; 
	Объект.Семестр = Спр.Семестр; 
	Объект.ФормаОбучения = Спр.ФормаОбучения;
КонецПроцедуры

&НаКлиенте
Процедура ПериодСессииПриИзменении(Элемент)
	ПериодСессииПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписьВЖурналеУчетаВыдачиВедомостейНаСервере()
	Док = Документы.ЖурналВыдачиЭкзаменационныхВедомостей.СоздатьДокумент(); 
	Док.Дата = ТекущаяДата(); 
	Док.периодСессии = объект.периодСессии; 
	Док.Семестр = Объект.Семестр; 
	Док.ДатаНачалаСессии = Объект.ДатаНачалаСессии; 
	Док.ДатаОкончанияСессии = Объект.ДатаОкончанияСессии; 
	Док.ФормаОбучения = Объект.ФормаОбучения; 
	Для каждого стр из Объект.ТЧ Цикл 
		О = Док.ТЧ.Добавить(); 
		О.Ведомость = Стр.Ведомость; 
		о.Группа = Стр.Группа; 
		О.Дисциплина = стр.Дисциплина; 
		О.Принял = Стр.Принял; 
		Запрос = Новый Запрос; 
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗачетноЭкзаментационнаяВедомость.Номер КАК Номер
		               |ИЗ
		               |	Документ.ЗачетноЭкзаментационнаяВедомость КАК ЗачетноЭкзаментационнаяВедомость
		               |ГДЕ
		               |	ЗачетноЭкзаментационнаяВедомость.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка",Стр.Ведомость); 
		Рез = Запрос.Выполнить().Выбрать(); 
		рез.Следующий(); 
		Док2 = Документы.ЗачетноЭкзаментационнаяВедомость.НайтиПоНомеру(Рез.Номер).ПолучитьОбъект(); 
		Док2.Выдана = Истина; 
		Док2.Записать(РежимЗаписиДокумента.Запись); 
		Док2.Записать(РежимЗаписиДокумента.Проведение); 
	КонецЦикла;  
	Попытка 
		Док.Записать(РежимЗаписиДокумента.Запись); 
		Док.Записать(РежимЗаписиДокумента.Проведение); 
		Сообщить("Создана запись в журнале выдачи ведомостей"); 
	Исключение 
		Сообщить("Журнал НЕ создан"); 
	КонецПопытки; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаписьВЖурналеУчетаВыдачиВедомостей(Команда)
	СоздатьЗаписьВЖурналеУчетаВыдачиВедомостейНаСервере();
КонецПроцедуры
