
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Для каждого стр из Объект.ТЧ Цикл 
	Док = Документы.ЗачетнаяКнижкаСтудента.НайтиПоРеквизиту("Студент",Объект.Студент).ПолучитьОбъект(); 
	парам = Новый Структура; 
	Парам.Вставить("Дисциплина",Стр.Дисциплина); 
	НС = Док.СписокАттестационныхДисцилин.НайтиСтроки(Парам); 
	Для каждого строк из НС цикл 
		
		Строк.Оценка = Стр.Оценка;
		Строк.перезачтено = Истина; 
	КонецЦикла; 
	
		
         Док.Записать(РежимЗаписиДокумента.Запись); 
		 Док.Записать(РежимЗаписиДокумента.Проведение); 
		
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаявлениеНаПересдачуПриИзмененииНаСервере()
	Док = Документы.ЗаявленияНаПересдачу.НайтиПоНомеру(Объект.ЗаявлениеНаПересдачу.Номер); 
	Объект.Студент = Док.Студент; 
	Док2 = Документы.ЗачетнаяКнижкаСтудента.НайтиПоРеквизиту("Студент",Док.Студент); 
	Объект.НомерЗачетнойКнижки = Док2.НомерЗачетнойКнижки; 
	Объект.НаправлениеПодготовки = Док2.ПрофильНаправления; 
	
	Запрос = Новый запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	КафедрыПрофилиНаправления.Ссылка.Факультет КАК Факультет
	               |ИЗ
	               |	Справочник.Кафедры.ПрофилиНаправления КАК КафедрыПрофилиНаправления
	               |ГДЕ
	               |	КафедрыПрофилиНаправления.Профиль = &Профиль"; 
	Запрос.УстановитьПараметр("ПРофиль",Док2.ПрофильНаправления); 
	рез = Запрос.Выполнить().Выбрать(); 
	Рез.Следующий(); 
	Объект.Факультет = рез.Факультет; 
	
	Для каждого стр из Док.ТЧ Цикл 
	О = Объект.ТЧ.Добавить(); 
	О.Дисциплина = Стр.Дисциплина; 
	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявлениеНаПересдачуПриИзменении(Элемент)
	ЗаявлениеНаПересдачуПриИзмененииНаСервере();
КонецПроцедуры



