Процедура Перевод(СтрокаТаблЧасти,Оценка,ОбъекмДисц) Экспорт   
						
					Если СтрокаТаблЧасти < ОбъекмДисц.Незачтено Тогда 
						Оценка = перечисления.ВидыОценокЗачет.НеЗачтено; 
					КонецЕсли; 
					Если  СтрокаТаблЧасти >= ОбъекмДисц.Зачтено Тогда 
						Оценка = перечисления.ВидыОценокЗачет.Зачтено; 
					КонецЕсли;
					Если  СтрокаТаблЧасти  >= ОбъекмДисц.Четыре Тогда 
						Оценка = 4; 
					КонецЕсли;
					Если  СтрокаТаблЧасти  >= ОбъекмДисц.Пять Тогда 
						Оценка = 5; 
					КонецЕсли; 
	
КонецПроцедуры