
&НаСервере
Процедура СеместрПриИзмененииНаСервере()
		Если Не ПустаяСтрока(Объект.Группа) тогда 
		Объект.ТЧ.Очистить();
		Запрос = Новый запрос; 
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Ссылка.Студент КАК Студент,
		               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Оценка КАК Оценка,
		               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Дисциплина КАК Дисциплина
		               |ИЗ
		               |	Документ.ЗачетнаяКнижкаСтудента.СписокАттестационныхДисцилин КАК ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин
		               |ГДЕ
		               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Ссылка.Группа = &Группа";
		Запрос.УстановитьПараметр("Группа",Объект.Группа); 
		Рез = Запрос.Выполнить().Выгрузить(); 
		Для каждого стр из рез Цикл 
			Если ПустаяСтрока(Стр.Оценка) ИЛИ Стр.Оценка = Перечисления.ВидыОценокЗачет.НеЗачтено ИЛИ Стр.Оценка = 2 Тогда
				О = Объект.ТЧ.Добавить();
				О.студент = Стр.Студент; 
				О.Дисциплина = Стр.Дисциплина; 
				О.наличиеАкадемЗадолженности = истина; 
				
			КонецЕсли; 
			
			
		КонецЦикла; 
		
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СеместрПриИзменении(Элемент)
	СеместрПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаявленияНаПереаттестациюНаСервере()
	Для каждого стр из объект.ТЧ Цикл  
		Если Стр.ЗаявлениеНаПереаттестацию = истина Тогда  
			Док = Документы.ЗаявленияНаПересдачу.СоздатьДокумент(); 
			Док.Дата = ТекущаяДата(); 
			Док.Студент = стр.Студент; 
			Док.Группа = Объект.Группа;
			
			Запрос = Новый запрос; 
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Дисциплина КАК Дисциплина,
			               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Семестр КАК Семестр,
			               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Преподаватель КАК Преподаватель,
			               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Оценка КАК Оценка,
			               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Долг КАК Долг
			               |ИЗ
			               |	Документ.ЗачетнаяКнижкаСтудента.СписокАттестационныхДисцилин КАК ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин
			               |ГДЕ
			               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Ссылка.Студент = &Студент
			               |	И ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Семестр = &Семестр";
		Запрос.УстановитьПараметр("Студент",стр.Студент); 
		Запрос.УстановитьПараметр("Семестр",Объект.Семестр); 
		рез = Запрос.Выполнить().Выгрузить(); 
		Для каждого строка из рез Цикл 
			Если пустаяСтрока(строка.Оценка) ИЛИ Строка.Оценка = Перечисления.ВидыОценокЗачет.НеЗачтено ИЛИ Строка.Оценка = 2 Тогда 
			О = Док.ТЧ.Добавить(); 
			О.Дисциплина = Строка.Дисциплина; 
			О.Семестр = Строка.Семестр; 
			Если Строка.Семестр = перечисления.Семестры.Псеместр ИЛИ Строка.Семестр = перечисления.Семестры.Втсеместр Тогда 
				Курс = 1; 
			КонецЕсли; 
			Если Строка.Семестр = перечисления.Семестры.Трсеместр ИЛИ Строка.Семестр = перечисления.Семестры.Чтсеместр Тогда 
				Курс = 2; 
			КонецЕсли;
			Если Строка.Семестр = перечисления.Семестры.ПятСеместр ИЛИ Строка.Семестр = перечисления.Семестры.ШесСеместр Тогда 
				Курс = 3; 
			КонецЕсли;
			О.Курс = Курс; 
			О.Преподаватель = Строка.Преподаватель; 
			КонецЕсли; 
			
			
		КонецЦикла; 
		  Попытка
		Док.Записать(РежимЗаписиДокумента.Запись); 
		  Док.Записать(РежимЗаписиДокумента.Проведение);
		  Сообщить("Создано заявление на переаттестацию для студента (ки)" + " " + Стр.Студент); 
	  Исключение 
		  Сообщить("Заявление на переаттестацию не создано"); 
		  КонецПопытки; 
		  
		  
		КонецЕсли; 
		
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявленияНаПереаттестацию(Команда)
	СоздатьЗаявленияНаПереаттестациюНаСервере();
КонецПроцедуры
